tutorials/flow-over-heated-plate-steady-state/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Interface;
    patches           (interface);
    
    readData
    (
      Sink-Temperature-Solid
      Heat-Transfer-Coefficient-Solid
    );
    
    writeData
    (
      Sink-Temperature-Fluid
      Heat-Transfer-Coefficient-Fluid
    );
  };
};
